9/data/attachments/4bff91957d23d3e2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c7d0945f-1585-4d18-8a83-78dd6ba0f2f5</nif:username>
            <nif:friendToBeAdded>Richard_prove_Friend_45990_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>